src/scc/test/Artillery/create-communities.yml
#Create initial set of communities
config:
  target: 'http://scc-backend-41631.azurewebsites.net'
  http:
    pool: 10
  processor: "./test-utils.js"
  phases:
    - duration: 1
      arrivalCount: 1

scenarios:
  - name: 'Create communities'
    flow:
      - loop:
        - function: "genNewCommunity"
        - post:
            url: "/comms"
            headers:
              Accept: text/plain
            json:
              name: "{{ name }}"
        count: 250