src/scc/test/Artillery/create-posts.yml
#Create initial set of posts
config:
  target: 'http://scc-backend-41631.azurewebsites.net'
  plugins:
    metrics-by-endpoint: {}
  http:
    pool: 10
  processor: "./test-utils.js"
  phases:
    - duration: 1
      arrivalCount: 1

scenarios:
  - name: 'Create posts'
    flow:
      - loop:
        - function: "genNewPost"
        - post:
            url: "/media/"
            headers:
              Content-Type: application/octet-stream
              Accept: text/plain                    
            beforeRequest: "setNewPostImageBody"
            afterResponse: "genNewImageReply"            
            ifTrue: "hasImage"
        - post:
            url: "/post/"
            headers:
              Accept: text/plain
            json:
              community: "{{ community }}"
              userCreator: "{{ creator }}"
              textMessage: "{{ msg }}"
              linkMultimedia: "{{ imageId }}"
              refParent: "{{ parentId }}"
            afterResponse: "genNewPostReply"
        count: 250